Gadget_Project/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПрав</name>
    <attributes>
      <name>ИмяРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Активно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Gadget_Project/src/Catalogs/Пользователи/ManagerModule.bsl
// Описание
// 
// Параметры:
// 	ПользовательСеанса - ПользовательИнформационнойБазы - 
// Возвращаемое значение:
// 	- СправочникСсылка.Пользователи -
Функция НайтиИлиСоздатьПользователя(ПользовательСеанса) Экспорт
	
	ПользовательСсылка = НайтиПоНаименованию(ПользовательСеанса.Имя);
	
	Если ( ПользовательСсылка.Пустая() ) Тогда
		
		НовыйПользователь = СоздатьЭлемент();
		НовыйПользователь.Наименование = ПользовательСеанса.Имя;
		НовыйПользователь.ПолноеИмя = ПользовательСеанса.ПолноеИмя;
		
		ЗаполнитьТаблицуРолей(НовыйПользователь);
		НовыйПользователь.Записать();
		
		ПользовательСсылка = НовыйПользователь.Ссылка;
		 
	КонецЕсли;
	
	Возврат ПользовательСсылка;
	
КонецФункции

Процедура ЗаполнитьТаблицуРолей(Пользователь) Экспорт
	
	Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		Пользователь = Пользователь.ПолучитьОбъект();		
	КонецЕсли;
	
	ПользовательСеанса = ПользователиИнформационнойБазы.НайтиПоИмени(Пользователь.Наименование);
	
	Пользователь.СписокПрав.Очистить();
	НаборПрав = Метаданные.Роли;
	
	Для Каждого ТекРоль Из НаборПрав Цикл
		НоваяСтрокаРоли = Пользователь.СписокПрав.Добавить();
		НоваяСтрокаРоли.ИмяРоли = ТекРоль.Имя;
		НоваяСтрокаРоли.ПредставлениеРоли = ТекРоль.Синоним;
		НоваяСтрокаРоли.Активно = ПользовательСеанса.Роли.Содержит(ТекРоль);
	КонецЦикла;
	
	Пользователь.Записать();
	
КонецПроцедуры
